Public Member Functions | Friends | List of all members
ACAPI::MEP::v1::BendUIManager Class Referencefinal
MEP Element Manager
The BendUIManager contains UI-related services for a Bend. More...
#include <MEPBendUIManager.hpp>
 Inheritance diagram for ACAPI::MEP::v1::BendUIManager:
 Public Member Functions
Result< BendDefault >  | CreateBendDefaultFromToolUIData (const TBUI::IAPIToolUIData &toolUIData)
Creates a BendDefault from a toolUIData.
Result< void >  | ApplyBendDefaultToToolUIData (TBUI::IAPIToolUIData &toolUIData, const BendDefault &bendDefault)
Changes the default elem in the given toolUIData.
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
Result< BendUIManager >  | CreateBendUIManager ()
Creates a BendUIManager.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The BendUIManager contains UI-related services for a Bend.
Since
Archicad 28
Member Function Documentation
◆ ApplyBendDefaultToToolUIData()
 Result< void > ACAPI::MEP::v1::BendUIManager::ApplyBendDefaultToToolUIData  |  ( |  TBUI::IAPIToolUIData &  |  toolUIData,
|  const BendDefault &  |  bendDefault
)
Changes the default elem in the given toolUIData.
Parameters
toolUIData | The data in which the default elem will be changed
bendDefault | The default to be set
Returns
Returns error if the BendDefault is not the same type as the Default in IAPIToolUIData, or if they mismatch in their MEP Domain, otherwise nothing.
◆ CreateBendDefaultFromToolUIData()
 Result< BendDefault > ACAPI::MEP::v1::BendUIManager::CreateBendDefaultFromToolUIData  |  ( |  const TBUI::IAPIToolUIData &  |  toolUIData | )
Creates a BendDefault from a toolUIData.
Parameters
toolUIData | The data which contains the temporary state of the Bend in the scope of a Settings Dialog.
Returns
Returns error if the given Default from the IAPIToolUIData is not an BendDefault, otherwise returns the BendDefault created from it.
Friends And Related Symbol Documentation
◆ CreateBendUIManager
 Result< BendUIManager > CreateBendUIManager  |  ( |   | )
friend
Creates a BendUIManager.
Returns
If able, creates a new manager for Bend, otherwise Error.